/*
 This file is part of the OdinMS Maple Story Server
 Copyright (C) 2008 ~ 2010 Patrick Huy <patrick.huy@frz.cc> 
 Matthias Butz <matze@odinms.de>
 Jan Christian Meyer <vimes@odinms.de>

 This program is free software: you can redistribute it and/or modify
 it under the terms of the GNU Affero General Public License version 3
 as published by the Free Software Foundation. You may not use, modify
 or distribute this program under any other version of the
 GNU Affero General Public License.

 This program is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 GNU Affero General Public License for more details.

 You should have received a copy of the GNU Affero General Public License
 along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
package tools;

import java.io.Serializable;

/**
 * Created by MechAviv on 10/27/2019.
 */
public enum ModifiedQuestTime {
    // Format: yyyy/M/dd/hh/mm
    // Leave null if no start/end

    //disable
    /*열쇠공_젠의_모험(3163, "2021/12/31/00/00", "2099/12/31/00/00"),
    주민들을_구출하라(3162, "2021/12/31/00/00", "2099/12/31/00/00"),
    튜브(10405, "2020/06/01/00/00", "2099/06/30/23/59"),
    패밀리퀘스트(2231, "2021/06/01/00/00", "2099/06/30/23/59"),
    도쿄1(4681, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄2(4682, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄3(4683, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄4(4684, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄5(4685, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄6(4686, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄7(4687, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄8(4688, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄9(4689, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄10(4690, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄11(4691, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄12(4692, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄13(4693, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄14(4694, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄15(4695, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄16(4696, "2021/01/09/00/00", "2099/06/30/23/59"),
    도쿄17(4697, "2021/06/01/00/00", "2099/06/30/23/59"),
    도쿄18(4698, "2021/06/01/00/00", "2099/06/30/23/59"),
    도쿄_1(50034, "2021/06/01/00/00", "2099/06/30/23/59"),
    도쿄_2(5371, "2021/01/01/00/00", "2099/06/30/23/59"),
    도쿄_3(5374, "2021/01/01/00/00", "2099/06/30/23/59"),
    할로윈1(9529, null, "2020/12/31/00/00"),
    할로윈2(9530, null, "2020/12/31/00/00"),
    할로윈3(9531, null, "2020/12/31/00/00"),
    할로윈4(9532, null, "2020/12/31/00/00"),
    할로윈5(9533, null, "2020/12/31/00/00"),
    할로윈6(9534, null, "2020/12/31/00/00"),
    할로윈7(9535, null, "2020/12/31/00/00"),
    할로윈8(9536, null, "2020/12/31/00/00"),
    할로윈9(9537, null, "2020/12/31/00/00"),
    할로윈10(9538, null, "2020/12/31/00/00"),
    할로윈11(9539, null, "2020/12/31/00/00"),
    할로윈12(9540, null, "2020/12/31/00/00"),
    할로윈13(9541, null, "2020/12/31/00/00"),
    할로윈14(9542, null, "2020/12/31/00/00"),
    할로윈15(9543, null, "2020/12/31/00/00"),
    할로윈16(9544, null, "2020/12/31/00/00"),
    할로윈17(9545, null, "2020/12/31/00/00"),
    할로윈18(9546, null, "2020/12/31/00/00"),
    할로윈19(9547, null, "2020/12/31/00/00"),
    할로윈20(9548, null, "2020/12/31/00/00"),
    할로윈21(9549, null, "2020/12/31/00/00"),
    할로윈22(9550, null, "2020/12/31/00/00"),
    할로윈23(9551, null, "2020/12/31/00/00"),
    할로윈24(9552, null, "2020/12/31/00/00"),
    할로윈25(9553, null, "2020/12/31/00/00"),
    할로윈26(9554, null, "2020/12/31/00/00"),
    할로윈27(9555, null, "2020/12/31/00/00"),
    할로윈28(9556, null, "2020/12/31/00/00"),
    할로윈29(9557, null, "2020/12/31/00/00"),
    할로윈30(9558, null, "2020/12/31/00/00"),
    할로윈31(9559, null, "2020/12/31/00/00"),
    할로윈32(9923, null, "2020/12/31/00/00"),
    할로윈33(9924, null, "2020/12/31/00/00"),//9559 
     */
    //GOLDEN_TEMPLE_1(10580, null, "2020/12/31/00/00"),
    //GOLDEN_TEMPLE_2(10581, null, "2020/12/31/00/00"),
    //테스트용
    /*NEW_YEAR1(9330, null, "2020/12/31/00/00"),
    NEW_YEAR2(9331, null, "2020/12/31/00/00"),
    NEW_YEAR3(9332, null, "2020/12/31/00/00"),
    NEW_YEAR4(9333, null, "2020/12/31/00/00"),
    GOLDRICH_COMPASS(10593, null, "2020/12/31/00/00"),//골드리치
    NEW_YEAR(10600, null, "2020/12/31/00/00"),
    TIGER1(10601, null, "2020/12/31/00/00"),
    TIGER2(10602, null, "2020/12/31/00/00"),
    TIGER3(10603, null, "2020/12/31/00/00"),
    TIGER4(10604, null, "2020/12/31/00/00"),
    TIGER5(10605, null, "2020/12/31/00/00"),
    POLAROID(10606, null, "2020/12/31/00/00"),
    NEW_YEAR_FORTUNE(10607, null, "2020/12/31/00/00"),
    CYGNUS_RING(29305, null, "2020/12/31/00/00"),
    NEWYEARMEDAL(10488, null, "2020/12/31/00/00");*/
    /*RAINBOW_WEEK(10430, null, "2020/12/31/00/00"), //시작
    F_RAINBOW_WEEK1(10431, null, "2020/12/31/00/00"), //토
    F_RAINBOW_WEEK2(10432, null, "2020/12/31/00/00"), //일
    F_RAINBOW_WEEK3(10433, null, "2020/12/31/00/00"), //월
    F_RAINBOW_WEEK4(10434, null, "2020/12/31/00/00"), //화
    F_RAINBOW_WEEK5(10435, null, "2020/12/31/00/00"), //수
    F_RAINBOW_WEEK6(10436, null, "2020/12/31/00/00"), //목
    F_RAINBOW_WEEK7(10437, null, "2020/12/31/00/00"), //금

    S_RAINBOW_WEEK2(10450, null, "2020/12/31/00/00"), //월
    S_RAINBOW_WEEK3(10452, null, "2020/12/31/00/00"),
    S_RAINBOW_WEEK4(10453, null, "2020/12/31/00/00"),
    S_RAINBOW_WEEK5(10458, null, "2020/12/31/00/00"),
    S_RAINBOW_WEEK6(10461, null, "2020/12/31/00/00"),
    S_RAINBOW_WEEK7(10463, null, "2020/12/31/00/00"),*/
    /*
    10450 - 10.4~10.18 //빨간색의 월요일
    10458 - 10.4~10.18 //골드리치의 나침반
    
    10452 - 10.6~10.7 //노란색의 수요일
    10453 - 10.6~10.7 //노란색의 수요일
    10461 - 10.6~10.7 //노란색의 수요일
    10463 - 10.16~10.17 //노란색의 수요일
    
    10452 - 노란색의 수요일
    10453 - 노란색의 수요일
    10461 - 노란색의 수요일
    10463 - 노란색의 수요일
   
     */
    //본섭용
    궁모(20734, "2099/01/01/00/00", "2099/12/31/23/59"),
    NEW_YEAR1(9330, "2020/01/18/00/00", "2020/02/02/00/00"),
    NEW_YEAR2(9331, "2020/01/18/00/00", "2020/02/02/00/00"),
    NEW_YEAR3(9332, "2020/01/18/00/00", "2020/02/02/00/00"),
    NEW_YEAR4(9333, "2020/01/18/00/00", "2020/02/02/00/00"),
    GOLDRICH_COMPASS(10593, "2020/01/18/00/00", "2020/02/02/00/00"),//골드리치
    NEW_YEAR(10600, "2020/01/18/00/00", "2020/02/02/00/00"),
    TIGER1(10601, "2020/01/18/00/00", "2020/02/02/00/00"),
    TIGER2(10602, "2020/01/18/00/00", "2020/02/02/00/00"),
    TIGER3(10603, "2020/01/18/00/00", "2020/02/02/00/00"),
    TIGER4(10604, "2020/01/18/00/00", "2020/02/02/00/00"),
    TIGER5(10605, "2020/01/18/00/00", "2020/02/02/00/00"),
    POLAROID(10606, "2020/01/18/00/00", "2020/02/02/00/00"),
    NEW_YEAR_FORTUNE(10607, "2020/01/18/00/00", "2020/02/02/00/00"),
    CYGNUS_RING(29305, "2020/01/18/00/00", "2020/02/02/00/00"),
    NEWYEARMEDAL(10488, "2020/01/18/00/00", "2020/02/02/00/00");
    private final int questID;
    private final String start, end;

    ModifiedQuestTime(int questID, String start, String end) {
        this.questID = questID;
        this.start = start;
        this.end = end;
    }

    public int getQuestID() {
        return questID;
    }

    public String getStart() {
        return start;
    }

    public String getEnd() {
        return end;
    }
}
